<?php

return [
    'not_found' => 'Не найден тип обслуживания.',
    'create' => [
        'error' => 'Тип обслуживания не был создан, пожалуйста попробуйте ещё раз.',
        'success' => 'Тип обслуживания успешно создан.',
    ],
    'update' => [
        'error' => 'Тип обслуживания не был обновлен, пожалуйста попробуйте ещё раз.',
        'success' => 'Тип обслуживания успешно обновлен.',
    ],
    'delete' => [
        'confirm' => 'Вы действительно хотите удалить этот тип обслуживания?',
        'error' => 'Возникла проблема с удалением этого типа обслуживания. Пожалуйста, попробуйте еще раз.',
        'success' => 'Тип обслуживания успешно обновлен.',
    ],
    'complete' => [
        'success' => 'Обслуживание отмечено как завершенное.',
        'error' => 'Возникла проблема с пометкой этого обслуживания как завершенного. Пожалуйста, попробуйте снова.',
    ],
];
